Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/district_court_civil_juris.html.txt.tmx
Source language: en
Languages: ga

source: The District Court is the lowest court in the Irish court system
ga: Tá an Chúirt Dúiche ar an gcúirt is ísle i gcóras cúirte na hÉireann

source: It is presided over by the President of the District Court and 63 District Court Judges
ga: Tá Uachtarán na Cúirt Dúiche chomh maith le 63 Breitheamh den Chúirt Dúiche i gceannas uirthi

source: The District Court is organised on a regional basis
ga: Tá an Chúirt Dúiche eagraithe ar bhonn réigiúnach

source: There are 23 District Court Districts, as well as the Dublin Metropolitan District
ga: Tá 23 Dúiche sa Chúirt Dúiche, chomh maith le Dúiche Cheannchathartha Bhaile Átha Cliath

source: Each District is in turn divided into District Court areas
ga: Tá gach Dúiche ansin roinnte i gceantair den Chúirt Dúiche

source: The District Court is a court of local and limited jurisdiction
ga: Is cúirt áitiúil agus le húdarás srianta é an Chúirt Dúiche

source: This means it is restricted as to which cases it can decide in both civil and criminal matters
ga: Ciallaíonn sé seo go bhfuil sí srianta ó thaobh na gcásanna ar féidir léi cinneadh a dhéanamh i gcúinsí sibhialta agus coiriúla

source: Under Part 3 of the Courts and Civil Law (Miscellaneous Provisions) Act 2013 the monetary jurisdiction of the District Court increased to €15,000 (was €6,348.69) with effect from 3 February 2014
ga: Faoi Chuid 3 d'Acht na gCúirteanna agus an Dlí Sibhialta (Forálacha Ilghnéitheacha) 2013 an dlínse airgeadaíochta na Cúirte Dúiche méadaithe go dtí €15,000 (ba é €6,348.69) le héifeacht ón 3 Feabhra 2014

source: A District Court cannot hear a case that has not been commenced in the correct District Court area
ga: Ní féidir le Cúirt Dúiche éisteacht le cás nár thosaíodh sa cheantar den Chúirt Dúiche cirte

source: The case must be brought, heard and decided in the District Court area:
ga: Ní mór an cás a thógáil, éisteacht leis agus cinneadh a dhéanamh air sa cheantar den Chúirt Dúiche:

source: • Where the defendant or one of the defendants ordinarily resides or carries on any profession, business or occupation
ga: • Ina bhfuil gnáthchónaí ar an gcosantóir nó duine de na cosantóirí nó san áit ina bhfuil siad ag obair, ina bhfuil gnó nó fostaíocht acu

source: • If the plaintiff chooses,
ga: • Má roghnaíonn an t-éilitheoir,

source: - in proceedings based on contract, where the contract was made
ga: - i gcásanna bunaithe ar chonradh, san áit inar rinneadh an conradh

source: - in proceedings based on tort (e.g., personal injuries actions), where the tort is alleged to have been committed
ga: - i gcásanna bunaithe ar thort (m.sh. cásanna gortaithe phearsanta), ina bhfuil sé líomhainte gur tharla an tort

source: - in proceedings to eject a person from lands or property, where the lands or property in question is located
ga: - i gcásanna chun duine a íobairt ó thailte nó ó mhaoin, san áit ina bhfuil na tailte nó an mhaoin atá i gceist lonnaithe;

source: The District Court is restricted to hearing cases where the damages or compensation sought do not exceed a certain amount
ga: Tá srian ar an gCúirt Dúiche maidir le héisteacht le cásanna ina dtéann na damáistí nó an cúiteamh atá á n-éileamh thar mhéid áirithe

source: The District Court can hear cases:
ga: Is féidir leis an gCúirt Dúiche éisteacht le cásanna:

source: • In contract generally where the claim does not exceed €15,000
ga: • I gconradh go ginearálta nuair nach dtéann an t-éileamh níos airde ná €15,000

source: • In actions founded on hire-purchase and credit-sale agreements where the hire-purchase price of the goods or the amount of the claim does not exceed €15,000
ga: • I gcásanna bunaithe ar chomhaontuithe fruilcheannaigh agus díolacháin creidmheasa, nuair nach dtéann praghas ceannaigh na n-earraí nó méid an éilimh thar €15,000

source: • In tort, where the claim for compensation does not exceed €15,000
ga: • I dtort, nuair nach dtéann an t-éileamh ar chúiteamh thar €15,000

source: • In ejectment for non-payment of rent or overholding of property, where the annual rent does not exceed €15,000 per annum
ga: • In imeacht eisiachtana mar gheall ar neamh-íocaíocht de chíos nó maoin a róshealbhú, nuair nach dtéann an cíos bliantúil thar €15,000 in aghaidh na bliana

source: • In actions for wrongful detention of goods where the value of the goods claimed does not exceed €15,000
ga: • I gcásanna de choinneáil éagórach d’earraí nuair nach dtéann luach na n-earraí éilithe thar €15,000

source: Other types of cases that the District Court may hear include:
ga: D’fhéadfadh an Chúirt Dúiche éisteacht le cineálacha cásanna eile lena n-áirítear:

source: • Family cases where the District Court has the power to make maintenance, barring, custody, access and affiliation orders
ga: • Cásanna teaghlaigh nuair atá an chumhacht ag an gCúirt Dúiche orduithe cothabhála, barrtha, coimeádta, rochtana agus comhcheangail a dhéanamh

source: • Enforcement of judgements, including the power to examine debtors as to their means, to order payment of the debt by instalments and to commit the debtor to prison for default in payment
ga: • Feidhmiú breithiúnais, lena n-áirítear an chumhacht scrúdú a dhéanamh ar fhiachóirí maidir lena n-acmhainní, íocaíocht an fhéich a ordú trí dhíolaíochtaí agus an fiachóir a aithint do phríosún sa chás go dteipeann orthu íoc

source: • Licensing cases, e.g., the granting of certificates for intoxicating liquor licences, the granting of certificates for auctioneer's and the lottery licences, the granting of licences for public dancing, etc
ga: • Cásanna ceadúnaithe, m.sh. teastais a bhronnadh do cheadúnais deochanna meisciúla, teastais a bhronnadh do cheadúnais ceantálaí agus crannchuir, ceadúnais a bhronnadh do damhsaí poiblí, srl

source: • Malicious damages cases where the amount claimed does not exceed €15,000
ga: • Cásanna damáistí mailíseacha nuair nach dtéann an mhéid atá á éileamh thar €15,000

source: A criminal case will be heard in the District Court area where:
ga: Éistfear le cás coiriúil sa cheantar den Chúirt Dúiche:

source: • The offence was committed or
ga: • Inar rinneadh an choir nó

source: • The defendant resides or carries on business or
ga: • Ina bhfuil cónaí ar an gcosantóir nó ina ndéanann sé/sí a g(h)nó nó

source: • The defendant was arrested
ga: • Inar gabhadh an cosantóir

source: There are two types of criminal offences:
ga: Tá dhá chineál choir choiriúla ann:

source: • Summary offences, i.e., offences that are tried by a judge sitting alone
ga: • Coireanna achomair, m.sh. coireanna atá triailithe ag breitheamh atá ag suí leis/léi féin

source: • Indictable offences, i.e., offences that can be tried by a judge and jury
ga: • Coireanna díotálacha, m.sh., coireanna a d'fhéadfadh a bheith triailithe ag breitheamh agus giúiré

source: The criminal jurisdiction of the District Court falls under the following headings
ga: Tagann údarás cóiriúil den Chúirt Dúiche faoi na ceannteidil seo a leanas

source: Summary offences that may be heard by the District Court Judge sitting without a jury. This makes up the great bulk of the work of the District Court and these offences come from legislation only
ga: Coireanna achomair a d'fhéadfadh a bheith eisithe ag Breitheamh den Chúirt Dúiche ag suí gan ghiúiré Déanann sé seo suas an-chuid den obair a dhéanann an Chúirt Dúiche agus tagann na coireanna seo ó reachtaíocht amháin

source: Indictable offences which are triable summarily on the basis that:
ga: Coireanna díoltálacha gur féidir a thriail go hachomair chomh fada agus go bhfuil:

source: • In the view of the judge, the facts alleged constitute a minor offence and
ga: • I dtuairim an bhreithimh, na fíricí líomhainte ina mionchoir agus

source: • The accused, on being informed of his/her right to be tried by a jury, does not object to being tried summarily and
ga: • An duine atá cúisithe i gcoinne nó tar éis agóid a dhéanamh i gcoinne a bheith triailte go hachomair, agus é ráite leis/léi go bhfuil sé de cheart aige a bheith triailte ag giúiré

source: • In the case of certain offences, the Director of Public Prosecutions has consented to a summary trial
ga: • I gcás coireanna áirithe, an Stiúrthóir Ionchúiseamh Poiblí tar éis triail achomair a cheadú

source: These types of offences are specified in the appropriate legislation
ga: Tá na cineálacha coireanna seo sainithe sa reachtaíocht chuí

source: Indictable offences that may be dealt with summarily (not certain offences including rape, aggravated sexual assault, murder, treason and piracy) when:
ga: Coireanna díoltálacha a d’fhéadfadh a bheith pléite go hachomair (ní coireanna áirithe lena n-áirítear éigniú, tromionsaí gnéasach, dúnmharú, tréas agus píoráideacht) nuair:

source: • The accused, when before the District Court, pleads guilty and
ga: • A phléadálann an té atá cúisithe ciontach, agus iad os comhair na Cúirte Dúiche agus

source: • The judge is satisfied that the accused understands the charge and
ga: • Atá an breitheamh sásta go dtuigeann an té atá cúisithe an chúis agus

source: • The Director of Public Prosecutions consents
ga: • A cheadaíonn an Stiúrthóir Ionchúiseamh Poiblí

source: If the case is not dealt with by the District Court, the accused is sent forward to the Circuit Court for sentence
ga: Mura bpléann an Chúirt Dúiche leis an gcás, cuirtear an té atá cúisithe ar aghaidh go dtí an Chúirt Chuarda le haghaidh pianbhreithe

source: At the Circuit Court, he/she may withdraw his/her plea of "guilty" and alter it to "not guilty", in which case a trial takes place
ga: Ag an gCúirt Charda, d’fhéadfadh sé/sí a p(h)léadáil de ‘ciontach’ a aistarraingt agus é a athrú go ‘neamhchiontach’ agus sa chás sin tarlaíonn triail

source: Indictable offences not triable summarily, that is, cases that must be heard by a judge and jury
ga: Coireanna díoltálacha nach féidir a thriail go hachomair, is é sin, cásanna a chaithfidh breitheamh agus giúiré éisteacht leo

source: In these cases, the accused is served with a "Book of Evidence", i.e., a statement of the charge and of the evidence intended to be introduced to the court and a list of witnesses and exhibits
ga: Sna cásanna seo, tá “Leabhar Fianaise” curtha os comhair an té atá cúisithe, m.sh., ráiteas den chúis agus den fhianaise a bheidh curtha i láthair os comhair na cúirte chomh maith le liosta finnéithe agus taispeántán

source: The Disrtict Court Judge no longer considers the material and submissions, on behalf of the accused or the prosecution, to decide whether there is a sufficient case
ga: Ní dhéanann an breitheamh den Chúirt Dúiche machnamh ar an ábhar nó ar na haighneachtaí níos mó, ar son an té atá cúisithe nó an ionchúisimh, d’fhonn cinneadh a dhéanamh an bhfuil leorchás ann

source: This was the process known as preliminary examination and has been abolished
ga: Ba phróiseas é seo ar a tugadh réamhscrúdú agus fuarthas réidh leis

source: The District Court Judge will send the accused forward to the Circuit Court or Central Criminal Court for trial once the book of evidence has been served and the DPP has consented to sending the case forward
ga: Seolfaidh an breitheamh den Chúirt Dúiche an té atá cúisithe ar aghaidh chuig an gCúirt Chuarda nó an bPríomh-Chúirt Choiriúil don triail tar éis don Leabhar Fianaise a bheith seirbheáilte agus gur cheadaigh an DPP an cás a sheoladh ar aghaidh
